.source/Tools/github.org
#+TITLE: Git and Github


https://github.com

全世界最大的代码托管网站


* Git 命令基础

#+BEGIN_QUOTE

Git 是当下最流行的版本控制工具(VCS)，由 linux 系统之父 linus 开发。
它能实现团队中的代码协作开发，它在代码同步和代码管理方面功能强大、理念先进。

Github.com 是基于 git 工具的一个代码托管网站，目前基本所有的开源项目都选择将自己的代码
托管到了 github。它里面的代码包罗万象，是一个学习的宝库。
#+END_QUOTE

首先，需要下载安装 git 工具
- https://git-scm.com/downloads

安装完毕之后，就可以进入提供的命令行窗口。

然后就可以使用了，比如:
#+BEGIN_SRC sh
  # 从 github 将我们的项目下载下来
  git clone https://github.com/nf147/nf147.github.io

  # 切换到项目目录
  cd nf147.github.io

  # 在项目里添加、修改一系列文件
  notepad index.html....

  # 如果要查看项目下的文件修改情况
  git status

  # 如果要将修改保存，并同步到服务器，分三步:
  git add .
  git commit -m '我是注释信息'
  git push

  # 当然，如果是第一次使用，可能需要先告诉 git 工具你是谁，执行下面两条命令
  git config --global user.email "你的邮箱地址"
  git config --global user.name "你的名字。这个随便填，只是为了方便git区分不同用户"

  # 后续，如果想将服务器的代码同步到本地
  git pull  # pull 拉 push 推

  # 查看历次修改历史
  git log
#+END_SRC

为命令取一个比较方便的别名:
#+BEGIN_SRC sh
  # Git config 命令是用来向配置文件中写入配置信息的
  # 这些配置信息会影响 git 工具的行为
  # 比如，配置 alias 会为命令提供相应的“别名”，可以方便我们的调用

  # 配置文件分为“全局”和“当前项目”，分别在 ~/.gitconfig 和 project/.git/config
  # 如果配置在全局配置文件里，那么配置参数会影响所有的 git 项目
  # 如果配置在本项目的 .git 目录里面，那么配置参数只会影响本项目

  # 如果要修改配置，有两种方式
  # 1. 手动修改相应配置文件
  # 2. 使用命令 git config 修改

  # git config 默认修改的是本项目的配置文件，如果想要修改“全局”配置文件，
  # 那么就需要传递 --global 命令行参数，如下:
  git config --global alias.st status
  git status
  git st

  git config --global user.name "my name is lucy."
#+END_SRC

* 注册账号

* 使用 Github 管理项目

* 使用 Github Page

首先，需要登陆你的 Github 账号。

其次，在你的 Github 中，添加一个 *特殊的仓库*，这个仓库的命名规则是:
: 你的账号名字.github.io

接下来，将仓库 ~clone~ 到本地，然后，在中间增加自己的 html 文件。

之后，将自己的修改同步到仓库。过稍许，你就可以通过下面链接看到你的 Github Page 页面了:
- https://你的账号名字.github.io
- https://你的账号名字.github.io/index.html
- https://你的账号名字.github.io/xxx.html
- https://你的账号名字.github.io/xxx/yyy.jpeeg


#+BEGIN_QUOTE

注意，如果访问的时候不指定文件，默认访问的是 ~index.html~。

请保证自己的项目根目录存在这个文件！
#+END_QUOTE
