Tools/github.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-08-08 周三 03:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Git and Github</title>
<meta name="generator" content="Org mode">
<meta name="author" content="某某人">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Git and Github</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8f10346">1. Git 命令基础</a></li>
<li><a href="#orgf10814a">2. 注册账号</a></li>
<li><a href="#org10aedb8">3. 使用 Github 管理项目</a></li>
<li><a href="#org7eac0c1">4. 使用 Github Page</a></li>
</ul>
</div>
</nav>
<p>
<a href="https://github.com">https://github.com</a>
</p>

<p>
全世界最大的代码托管网站
</p>


<section id="outline-container-org8f10346" class="outline-2">
<h2 id="org8f10346"><span class="section-number-2">1</span> Git 命令基础</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>

</p>

<p>
Git 是当下最流行的版本控制工具(VCS)，由 linux 系统之父 linus 开发。它能实现团队中的代码协作开发，它在代码同步和代码管理方面功能强大、理念先进。
</p>

<p>
Github.com 是基于 git 工具的一个代码托管网站，目前基本所有的开源项目都选择将自己的代码托管到了 github。它里面的代码包罗万象，是一个学习的宝库。
</p>
</blockquote>

<p>
首先，需要下载安装 git 工具
</p>
<ul class="org-ul">
<li><a href="https://git-scm.com/downloads">https://git-scm.com/downloads</a></li>
</ul>

<p>
安装完毕之后，就可以进入提供的命令行窗口。
</p>

<p>
然后就可以使用了，比如:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">&#20174; github &#23558;&#25105;&#20204;&#30340;&#39033;&#30446;&#19979;&#36733;&#19979;&#26469;</span>
git clone https://github.com/nf147/nf147.github.io

<span class="org-comment-delimiter"># </span><span class="org-comment">&#20999;&#25442;&#21040;&#39033;&#30446;&#30446;&#24405;</span>
<span class="org-builtin">cd</span> nf147.github.io

<span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#39033;&#30446;&#37324;&#28155;&#21152;&#12289;&#20462;&#25913;&#19968;&#31995;&#21015;&#25991;&#20214;</span>
notepad index.html....

<span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#35201;&#26597;&#30475;&#39033;&#30446;&#19979;&#30340;&#25991;&#20214;&#20462;&#25913;&#24773;&#20917;</span>
git status

<span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#35201;&#23558;&#20462;&#25913;&#20445;&#23384;&#65292;&#24182;&#21516;&#27493;&#21040;&#26381;&#21153;&#22120;&#65292;&#20998;&#19977;&#27493;:</span>
git add .
git commit -m <span class="org-string">'&#25105;&#26159;&#27880;&#37322;&#20449;&#24687;'</span>
git push

<span class="org-comment-delimiter"># </span><span class="org-comment">&#24403;&#28982;&#65292;&#22914;&#26524;&#26159;&#31532;&#19968;&#27425;&#20351;&#29992;&#65292;&#21487;&#33021;&#38656;&#35201;&#20808;&#21578;&#35785; git &#24037;&#20855;&#20320;&#26159;&#35841;&#65292;&#25191;&#34892;&#19979;&#38754;&#20004;&#26465;&#21629;&#20196;</span>
git config --global user.email <span class="org-string">"&#20320;&#30340;&#37038;&#31665;&#22320;&#22336;"</span>
git config --global user.name <span class="org-string">"&#20320;&#30340;&#21517;&#23383;&#12290;&#36825;&#20010;&#38543;&#20415;&#22635;&#65292;&#21482;&#26159;&#20026;&#20102;&#26041;&#20415;git&#21306;&#20998;&#19981;&#21516;&#29992;&#25143;"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#21518;&#32493;&#65292;&#22914;&#26524;&#24819;&#23558;&#26381;&#21153;&#22120;&#30340;&#20195;&#30721;&#21516;&#27493;&#21040;&#26412;&#22320;</span>
git pull  <span class="org-comment-delimiter"># </span><span class="org-comment">pull &#25289; push &#25512;</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#26597;&#30475;&#21382;&#27425;&#20462;&#25913;&#21382;&#21490;</span>
git log
</pre>
</div>

<p>
为命令取一个比较方便的别名:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Git config &#21629;&#20196;&#26159;&#29992;&#26469;&#21521;&#37197;&#32622;&#25991;&#20214;&#20013;&#20889;&#20837;&#37197;&#32622;&#20449;&#24687;&#30340;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#36825;&#20123;&#37197;&#32622;&#20449;&#24687;&#20250;&#24433;&#21709; git &#24037;&#20855;&#30340;&#34892;&#20026;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#27604;&#22914;&#65292;&#37197;&#32622; alias &#20250;&#20026;&#21629;&#20196;&#25552;&#20379;&#30456;&#24212;&#30340;&#8220;&#21035;&#21517;&#8221;&#65292;&#21487;&#20197;&#26041;&#20415;&#25105;&#20204;&#30340;&#35843;&#29992;</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#37197;&#32622;&#25991;&#20214;&#20998;&#20026;&#8220;&#20840;&#23616;&#8221;&#21644;&#8220;&#24403;&#21069;&#39033;&#30446;&#8221;&#65292;&#20998;&#21035;&#22312; ~/.gitconfig &#21644; project/.git/config</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#37197;&#32622;&#22312;&#20840;&#23616;&#37197;&#32622;&#25991;&#20214;&#37324;&#65292;&#37027;&#20040;&#37197;&#32622;&#21442;&#25968;&#20250;&#24433;&#21709;&#25152;&#26377;&#30340; git &#39033;&#30446;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#37197;&#32622;&#22312;&#26412;&#39033;&#30446;&#30340; .git &#30446;&#24405;&#37324;&#38754;&#65292;&#37027;&#20040;&#37197;&#32622;&#21442;&#25968;&#21482;&#20250;&#24433;&#21709;&#26412;&#39033;&#30446;</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#35201;&#20462;&#25913;&#37197;&#32622;&#65292;&#26377;&#20004;&#31181;&#26041;&#24335;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">1. &#25163;&#21160;&#20462;&#25913;&#30456;&#24212;&#37197;&#32622;&#25991;&#20214;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">2. &#20351;&#29992;&#21629;&#20196; git config &#20462;&#25913;</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">git config &#40664;&#35748;&#20462;&#25913;&#30340;&#26159;&#26412;&#39033;&#30446;&#30340;&#37197;&#32622;&#25991;&#20214;&#65292;&#22914;&#26524;&#24819;&#35201;&#20462;&#25913;&#8220;&#20840;&#23616;&#8221;&#37197;&#32622;&#25991;&#20214;&#65292;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#37027;&#20040;&#23601;&#38656;&#35201;&#20256;&#36882; --global &#21629;&#20196;&#34892;&#21442;&#25968;&#65292;&#22914;&#19979;:</span>
git config --global alias.st status
git status
git st

git config --global user.name <span class="org-string">"my name is lucy."</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-orgf10814a" class="outline-2">
<h2 id="orgf10814a"><span class="section-number-2">2</span> 注册账号</h2>
</section>

<section id="outline-container-org10aedb8" class="outline-2">
<h2 id="org10aedb8"><span class="section-number-2">3</span> 使用 Github 管理项目</h2>
</section>

<section id="outline-container-org7eac0c1" class="outline-2">
<h2 id="org7eac0c1"><span class="section-number-2">4</span> 使用 Github Page</h2>
<div class="outline-text-2" id="text-4">
<p>
首先，需要登陆你的 Github 账号。
</p>

<p>
其次，在你的 Github 中，添加一个<b>特殊的仓库</b>，这个仓库的命名规则是:
</p>
<pre class="example">
你的账号名字.github.io
</pre>

<p>
接下来，将仓库 <code>clone</code> 到本地，然后，在中间增加自己的 html 文件。
</p>

<p>
之后，将自己的修改同步到仓库。过稍许，你就可以通过下面链接看到你的 Github Page 页面了:
</p>
<ul class="org-ul">
<li><a href="https://你的账号名字.github.io">https://你的账号名字.github.io</a></li>
<li><a href="https://你的账号名字.github.io/index.html">https://你的账号名字.github.io/index.html</a></li>
<li><a href="https://你的账号名字.github.io/xxx.html">https://你的账号名字.github.io/xxx.html</a></li>
<li><a href="https://你的账号名字.github.io/xxx/yyy.jpeeg">https://你的账号名字.github.io/xxx/yyy.jpeeg</a></li>
</ul>


<blockquote>
<p>

</p>

<p>
注意，如果访问的时候不指定文件，默认访问的是 <code>index.html</code>。
</p>

<p>
请保证自己的项目根目录存在这个文件！
</p>
</blockquote>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 某某人</p>
<p class="date">Created: 2018-08-08 周三 03:43</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
